experiments/geo-mysql/results/redis-writes-50-k6.txt


  █ TOTAL RESULTS 

    checks_total.......: 2984    99.406297/s
    checks_succeeded...: 100.00% 2984 out of 2984
    checks_failed......: 0.00%   0 out of 2984

    ✓ ok
    ✓ found

    HTTP
    http_req_duration..............: avg=51.36ms p(50)=15.06ms p(95)=123.36ms p(99)=1.01s max=1.32s
      { expected_response:true }...: avg=51.36ms p(50)=15.06ms p(95)=123.36ms p(99)=1.01s max=1.32s
    http_req_failed................: 0.00%  0 out of 1492
    http_reqs......................: 1492   49.703149/s

    EXECUTION
    dropped_iterations.............: 8      0.266505/s
    iteration_duration.............: avg=51.61ms p(50)=15.3ms  p(95)=123.71ms p(99)=1.02s max=1.32s
    iterations.....................: 1492   49.703149/s
    vus............................: 1      min=0         max=50
    vus_max........................: 58     min=50        max=58

    NETWORK
    data_received..................: 1.7 MB 56 kB/s
    data_sent......................: 193 kB 6.4 kB/s