experiments/geo-mysql/results/redis-writes-500-k6.txt
time="2026-09-26T09:41:50+09:00" level=warning msg="Insufficient VUs, reached 400 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=probe
time="2026-09-26T09:42:11+09:00" level=warning msg="The test has generated metrics with 100143 unique time series, which is higher than the suggested limit of 100000 and could cause high memory usage. Consider not using high-cardinality values like unique IDs as metric tags or, if you need them in the URL, use the name metric tag or URL grouping. See https://grafana.com/docs/k6/latest/using-k6/tags-and-groups/ for details." component=metrics-engine-ingester


  █ TOTAL RESULTS 

    checks_total.......: 22812   728.06998/s
    checks_succeeded...: 100.00% 22812 out of 22812
    checks_failed......: 0.00%   0 out of 22812

    ✓ ok
    ✓ found

    HTTP
    http_req_duration..............: avg=867.81ms p(50)=905.99ms p(95)=1.71s p(99)=1.86s max=2.02s
      { expected_response:true }...: avg=867.81ms p(50)=905.99ms p(95)=1.71s p(99)=1.86s max=2.02s
    http_req_failed................: 0.00%  0 out of 11406
    http_reqs......................: 11406  364.03499/s

    EXECUTION
    dropped_iterations.............: 3594   114.706449/s
    iteration_duration.............: avg=868.32ms p(50)=906.54ms p(95)=1.71s p(99)=1.86s max=2.02s
    iterations.....................: 11406  364.03499/s
    vus............................: 150    min=39         max=400
    vus_max........................: 400    min=400        max=400

    NETWORK
    data_received..................: 13 MB  419 kB/s
    data_sent......................: 1.5 MB 47 kB/s